In [1]:
#Data Preprocessing
import pandas as pd

In [2]:
#reading Data_for_processing file

df=pd.read_csv('D:\\BigData_All_content\\Jupyter\\Data_for_preprocessing.csv', na_values='#')
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain   NaN      NaN        No
4      NaN  40.0   1000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  78.0  52000.0        No
7   France   NaN      NaN       Yes
8      NaN  50.0  83000.0        No
9   France  37.0      NaN       Yes

In [3]:
#Identify independent feature from the data

#here, we are dropping the 'Purchased' column from the dataset and initializing the X with 
#remaining columns
#Remaining column will be called independent variable/feature
#here, axis=1 means we want to delete 'Purchased' column

X=df.drop(['Purchased'], axis=1)
X

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain   NaN      NaN
4      NaN  40.0   1000.0
5   France  35.0  58000.0
6    Spain  78.0  52000.0
7   France   NaN      NaN
8      NaN  50.0  83000.0
9   France  37.0      NaN

In [4]:
#Identify dependent feature from the dataset

y=df['Purchased']
y

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [5]:
#Checking missing values in the X
X.isnull().sum()

Country    2
Age        2
Salary     3
dtype: int64

In [10]:
#Filling missing values 

#Fill missing values in numerical column

#Fill the missing values in numerical column with thier mean/average value

#Ex: Fillin missing data in 'Salary'

#first calculate the mean/average of 'Salary' column

import numpy as np

mean_salary=np.mean(X['Salary'])
print('Mean of salary column:',mean_salary)


#Replace the missing values in 'Salary' column with thier mean/average value

X['Salary'].fillna(mean_salary, inplace=True)

#This statement can also be given as:

#X['Salary'].fillna(np.mean(X['Salary']), inplace=True)

Mean of salary column: 52571.42857142857

In [11]:
X.isnull().sum()

Country    2
Age        2
Salary     0
dtype: int64

In [12]:
#Filling missing values in 'Age' column

X['Age'].fillna(np.mean(X['Age']), inplace=True)

In [13]:
X.isnull().sum()

Country    2
Age        0
Salary     0
dtype: int64

In [14]:
#Filling missing values in Categorical column

#Replace the missing values with high frequency data

#1. First count the frequency of each category/class in a categorical column
#use value_counts()

#Ex: To count frequency of each category of 'Country' column

X['Country'].value_counts()

France     4
Spain      3
Germany    1
Name: Country, dtype: int64

In [15]:
#Now, replace the missing values with high frequency data

#Ex: in country column, highest frequency is for 'France'
#Fill the missing value in 'country' column with 'France'

X['Country'].fillna('France', inplace=True)

In [16]:
X.isnull().sum()

Country    0
Age        0
Salary     0
dtype: int64

In [19]:
X['Country']

0     France
1      Spain
2    Germany
3      Spain
4     France
5     France
6      Spain
7     France
8     France
9     France
Name: Country, dtype: object

In [18]:
#Encoding categorical data
X['Country'].value_counts()

France     6
Spain      3
Germany    1
Name: Country, dtype: int64

In [ ]:
"""
Working of Label Encoder

France     	6
Spain      	3
Germany   1

Label Encoding

These two steps are performed by fit()

Step 1: Identifies unique categories in the categorical column
	France		
	Germany		
	Spain	

Step 2: Sort the unique categories in ascending order and assign a unique number to each category staring with 0

	France		0
	Germany		1
	Spain		2


This step is performed by transform()

Data in X['Country']
		Label Encoding
     France		0
     Spain		2
    Germany	1
      Spain		2
     France		0
     France		0
      Spain		2
     France		0	
     France		0
     France		0
"""

In [20]:
from sklearn.preprocessing import LabelEncoder

lb = LabelEncoder()


# Encode labels in column 'Country'. 
X['Country']= lb.fit_transform(X['Country']) 

X['Country']

0    0
1    2
2    1
3    2
4    0
5    0
6    2
7    0
8    0
9    0
Name: Country, dtype: int32

In [23]:
df['Country'].fillna('France', inplace=True)

In [24]:
df2=pd.DataFrame({'Old Data':df['Country'], 'Encoded Data':X['Country']})
df2

  Old Data  Encoded Data
0   France             0
1    Spain             2
2  Germany             1
3    Spain             2
4   France             0
5   France             0
6    Spain             2
7   France             0
8   France             0
9   France             0

In [ ]:
'''
Working of one-hot encoding


Data in X['Country']
		
     France		
     Spain		
    Germany	
      Spain		
     France		
     France		
      Spain		
     France			
     France		
     France

Uniqe Category in Country column

France
Germany
Spain

One-hot encoding

		   Country_France	Country_Germany	Country_Spain	
    France		1		              0		    0
     Spain		0		              0		    1
    Germany	    0		              1		    0
      Spain		0		              0		    1
     France		1		              0		    0
     France		1		              0		    0
      Spain		0		              0		    1
     France		1		              0		    0	
     France		1		              0		    0
     France		1		              0		0
'''

In [27]:
#Encoding categorical data using one-hot encoding

#get_dummies():transforms the categorical data into numerical data

df=pd.get_dummies(df)
df

,Age,Salary,Country_France,Country_Germany,Country_Spain,Purchased_No,Purchased_Yes
0,44.0,72000.000000,1,0,0,1,0
1,27.0,48000.000000,0,0,1,0,1
2,30.0,54000.000000,0,1,0,1,0
3,NaN,52571.428571,0,0,1,1,0
4,40.0,1000.000000,1,0,0,0,1
5,35.0,58000.000000,1,0,0,0,1
6,78.0,52000.000000,0,0,1,1,0
7,NaN,52571.428571,1,0,0,0,1
8,50.0,83000.000000,1,0,0,1,0
9,37.0,52571.428571,1,0,0,0,1